// **Наптши скрипт для відображення годин та хвилин у консоль браузера у вигляді
// *рядка формату "14 г. 26 хв.".Якщо значення змінної minuts дорівнює 0,
// *то виводь рядок "14 г.", без хвилин.
// *

// const hours = 14;
// const minuts = 0;
// let timestring;
// // if (minuts > 0) {
// //   timestring = `${hours}г. ${minuts}хв.`;
// // } else {
// //   timestring = `${hours}г.`;
// //   console.log("🚀 ~ timestring:", timestring);
// // }
// timestring = minuts > 0 ? `${hours}г. ${minuts}хв.` : `${hours}г.`;
// console.log("🚀 ~ timestring:", timestring);

// **
// * Напиши скрипт для відображення часу дедлайну злачі проєкту.Вмкористовуй if...else.
// * Якщо до дедлайну залишилось 0 днів - виведи "Today".
// * Якщо до дедлайну залишився 1 день - виведи "Tomorrow".
// * Якщо до дедлайну залишилось 2 дні - виведи "Owermorrow".
// * якщо до дедлайну залишилось 3+ і більше днів - виведи "Date in the future".
// *

// const daysUntilDeadline = 2;
// // if (daysUntilDeadline === 0) {
// //   console.log("Today");
// // } else if (daysUntilDeadline === 1) {
// //   console.log("Tomorrow");
// // } else if (daysUntilDeadline === 2) {
// //   console.log("Owermorrow");
// // } else {
// //   console.log("Date in the future");
// // }
// switch (daysUntilDeadline) {
//   case 0:
//     console.log("Today");
//     break;
//   case 1:
//     console.log("Tomorrow");
//     break;
//   case 2:
//     console.log("Owermorrow");
//     break;

//   default:
//     console.log("Date in the future");
// }

// let username;

// userName.addEventListener("change", function (event) {
//   const input = event.target;
//   const username = input.value;
//   switch (username) {
//     case "Poly":
//     case "Mango":
//       result.textContent = "ADMIN";
//       break;

//     default:
//       result.textContent = "Unregister user";
//   }
// });

//** Напиши скрипт вибору опції доставки товару.
// * Опція зберігається в змінній: 1 - самовмвіз, 2 - Кур'єр, 3 - пошта.
// * В зтінну message записати повідомлення в залежності від опції.
// * "Ви зможете забрати товар завтра з 12:00 в нашому офісі"
// * "Куд'єр доставить доставить замовлення завтра з 9:00 до 18:00"
// * "Посилку буде відправлено сьогодні"
// * "Вам зателефонує менеджер"
// *

// const option = 1;
// let message = "";
// switch (option) {
//   case 1:
//     message = `Ви зможете забрати товар завтра з 12:00 в нашому офісі`;
//     break;
//   case 2:
//     message = `Куд'єр доставить доставить замовлення завтра з 9:00 до 18:00`;
//     break;
//   case 3:
//     message = `Посилку буде відправлено сьогодні`;
//     break;

//   default:
//     message = `Вам зателефонує менеджер`;
// }
// console.log("🚀 ~ message:", message);

// **  Напиши скрипт перевірки підписки користувача при доступі до контента
//  * - Є три типа підписки: free, pro і vip.
//  * - Отримати доступ можуть тільки користувачі, pro і vip.
// *

// const sub = "free";
// const hasAccess = sub === "pro" || sub === "vip";
// console.log("🚀 ~ hasAccess:", hasAccess);

// **
//  * Напиши скрипт, який перевіряє моєливість відкрити чат з користувачем
//  * Для цього користувач має бути:
//  * - другом
//  * - онлайн
//  * - без режима не турбевати
//  *

// const isOnline = true;
// const isFriend = true;
// const isDnd = true;

// const canOpenChat = isOnline && isFriend && !isDnd;
// console.log("Можна відкрити чат?", canOpenChat);

// String().indexOf;

// const username = "Jacob Mercer";

// // console.log("🚀 ~ username.length:", username.length);
// const firstUserNameChar = username[0];
// // console.log("🚀 ~ firstUserNameChar:", firstUserNameChar);
// const lastUserNameChar = username[username.length - 1];
// // console.log("🚀 ~ lastUserNameChar:", lastUserNameChar);

// const res = username.slice();
// // console.log("🚀 ~ res:", res);

// const indexOfSpace = res.indexOf(" ");
// // console.log("🚀 ~ indexOfSpace:", indexOfSpace);

// const firstPhrase = res.slice(0, indexOfSpace);
// // console.log("🚀 ~ firstPhrase:", firstPhrase);

// const lastPhrase = res.slice(indexOfSpace + 1, res.length);
// // console.log("🚀 ~ lastPhrase:", lastPhrase);

// const fullPhrase = `${firstPhrase}${lastPhrase}`;
// // console.log("🚀 ~ fullPhrase:", fullPhrase);

// const withoutSpace = res.replace(" ", "");
// // console.log("🚀 ~ withoutSpace:", withoutSpace);

// const allLowerCaseLetters = username.toLowerCase();
// console.log("🚀 ~ allLowerCaseLetters:", allLowerCaseLetters);

// const allUperCaseLetters = username.toUpperCase();
// console.log("🚀 ~ allUperCaseLetters:", allUperCaseLetters);

// function capitalise(str) {
//   return str[0].toUpperCase() + str.slice(1);
// }
// const res2 = capitalise("mango");
// console.log("🚀 ~ res2:", res2);

// const userTextToArr = text.textContent.split(" ");
// const transformdArr = [];

// for (let index = 0; index < userTextToArr.length; index++) {
//   const capitaliseWord = capitalise(userTextToArr[index]);
//   transformdArr.push(capitaliseWord);
// }

// console.log(transformdArr.join(" "));

//  **
//  * Форматування посилання (endWith)
//  * Напиши скрипт який перевіряє чи закінчується значуння
//  * змінної link символом /. Якщо ні, додай до кінця
//  * значення link цей символ.
//  * Викормстовуй коеструкцію if...else.
//  */

// let link = "https://my-site.com/about";
// if (link.endsWith("/")) {
//   console.log(link);
// } else {
//   console.log(link + "/");
// }
// console.log("🚀 ~ link:", link);

//  **
//  * Форматування посилання (includes та логічне "I")
//  * Напиши скрипт який перевіряє чи закінчується значення
//  * змінної url /. Якщо ні, додай до кінця
//  * значення url цей символ, але тільки в тому випадку,
//  * якщо в url є підрядок "my-site".
//  * Використовуй конструкцію if...else або тернальний оператор.
//  */

// let url = "https://somesite.com/about";
// if (url.includes("my-site") && !url.endsWith("/")) {
//   console.log(url + "/");
// } else {
//   console.log(url);
// }

//  **
//  * Пошук у рядку методом includes()
//  */

// const blackListedWord1 = "spam";
// const blackListedWord2 = "sale";
// const string1 =
//   "Hello, I'm Prince Abdul, this is not spam, I'm offering you a mollion";
// const string2 = "Biggest SALE this week, don't miss out!";
// const string3 = "#fatlivesmatter advertising campaign";

// function checkSpamWord(text, spamWord1, spamWord2) {
//   const hasSpamWord =
//     text.toLowerCase().includes(spamWord1.toLowerCase()) ||
//     text.toLowerCase().includes(spamWord2.toLowerCase());
//   if (hasSpamWord) {
//     console.log("Текст містить заборонені слова ❌");
//   } else {
//     console.log("Текст не містить заборонені слова ✅");
//   }
// }
// checkSpamWord(string1, blackListedWord1, blackListedWord2);
// checkSpamWord(string2, blackListedWord1, blackListedWord2);
// checkSpamWord(string3, blackListedWord1, blackListedWord2);

// function countAscending(start, end) {
//   for (let index = start; index > end; index -= 2) {
//     console.log("Current value: ", index);
//   }
// }
// countAscending(12, 5);

// let a = 10;
// function calculate(number) {
//   let sum = 0;
//   for (let index = 0; index <= number; index++) {
//     sum += index;
//   }
//   return sum;
// }
// const res = calculate(a);
// console.log("🚀 ~ res:", res);

//  **
//  * Функція calculateEventTotal(number) приймає ціле число (параметр number).
//  * Доповни код функції так, щоб вона повертала
//  * суму всіх парних чисел від одиниці до цього числа включно.
//  * Парні числа - це ті, що можна поділити на 2 без остачі (як це
//  * зробити розглядалося у темі Арифметичні операції у модулі 1).
//  * Наприклад, якщо number дорівнює 6, то сума - це 2 + 4 + 6, тобто 12.
//  */

// function calculateEventTotal(number) {
//   let sum = 0;
//   for (let index = 0; index <= number; index++) {
//     if (index % 2 === 0) {
//       sum += index;
//     }
//   }
//   return sum;
// }
// const res = calculateEventTotal(6);
// console.log("🚀 ~ res:", res);

//  **
//  * Напиши цикл for, який виводить у консоль браузера
//  * число за зростанням від a до b, але тільки якщо число кратне 5.
//  */
// const a = 100;
// const b = 20;

// function showAscNumber(a, b) {
//   console.log(a, b);

//   let temp = a;
//   if (a > b) {
//     a = b;
//     b = temp;
//   }
//   console.log(a, b);

//   for (let index = a; index < b; index++) {
//     if (index % 5 !== 0) continue;
//     console.log(index);
//   }
// }
// showAscNumber(a, b);

//  **
//  * Напиши скрипт, який підраховує суму всіх парних чисел,
//  * які входять в діапазон чисел у змінних від min до max.
//  * Наприклад, ящо min = 0 a max = 5, то діапазон 0-5, і в ньому два
//  * парних числа - 2 і 4, їх сума 6
//  */
// const min = 0;
// const max = 5;
// let total = 0;
// function calculate(start, end) {
//   for (let i = start; i <= end; i++) {
//     if (i % 2 !== 0) continue;
//     {
//       total += i;
//     }
//   }
//   return total;
// }
// const res = calculate(min, max);
// console.log("🚀 ~ res:", res);

// **
// * Запропонуйте користувачу ввести число за допомогою prompt().
// * Збережіть введене значення у змінну number.
// * Перевірте, чи дорівнює змінна number числу 10:
// * Якщо так – виведіть повідомлення 'Вірно' у alert().
// * Якщо ні – виведіть 'Невірно'.
// */

// const number = Number(prompt("Insert number"));
// if (number === 10) {
//   alert("Вірно");
// } else {
//   alert("Не вірно");
// }
// console.log("🚀 ~ number:", number);

// ** У змінній min лежить випадкове число від 0 до 59.
// * Визначте, в яку чверть години потрапляє
// * це число (у першу, другу, третю чи четверту).
// * Виведіть в alert відповідне повідомлення, наприклад:
// */ "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);
// if (min <= 15) {
//   alert(`${min} входить в першу чверть`);
// } else if (min <= 30) {
//   alert(`${min} входить в другу чверть`);
// } else if (min <= 45) {
//   alert(`${min} входить в третю чверть`);
// } else {
//   alert(`${min} входить в четверту чверть`);
// }

// * Напишіть цикл, який виводить в консоль
// * числа от max до min по зменьшенню
// * Виведіть в консоль суму усіх парних чисел
// */ перепиши код на функцію getNumbers(min, max)

// const min = 0;
// const max = 20;
// let sum = 0;
// for (let i = max; i >= min; i--) {
//   console.log("🚀 ~ i:", i);
//   if (i % 2 === 0) {
//     sum += i;
//   }
// }
// console.log("🚀 ~ sum:", sum);

// function getNumbers(min, max) {
//   let sum = 0;
//   for (let i = max; i >= min; i--) {
//     console.log(i);

//     if (i % 2 === 0) {
//       sum += i;
//     }
//   }
//   return sum;
// }
// console.log(getNumbers(0, 20));

// ** Використовуйте цикл while, щоб вивести в console всі числа від 0 до 50 включно.
// */

// let i = 0;
// while (i <= 50) {
//   console.log(i);
//   i++;
// }

//  ** Наптшіть програму, яка отримує від користувача
//  * число(кількість хвилин) і виведіть у консоль
//  * рядок у форматі годин та хвилин
//  * https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/String/padStart
//  * 70 === 01:10
//  */

// const value = Number(prompt("Ведіть число:"));
// let hour = parseInt(value / 60);
// let min = value % 60;

// hour = String(hour).padStart(2, 0);
// min = String(min).padStart(2, 0);
// console.log(`${hour}:${min}`);

//  ** Змінна num може набувати чотири значення "1", "2", "3" або "4"
//  * (запитуй це запитання у користувача через prompt).
//  * Ящо воеа має значення "1", то у змінну result запишіть "зима",
//  * якщо має значення "2", - "весна" і так далі.
//  * Розв'яжіть завдання через switch-case.
//  * Не забудьте про дефолтне значення, на випадок, якщо користувач
//  * введк в prompt щось інше. В такому випадку result має наьути значення:
//  * "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
//  * Значення змінної result виведіть у консоль.
// */

// const num = Number(prompt("Введіть чтсло від 1 до 4 включно: "));
// let result = "";
// switch (num) {
//   case 1:
//     result = "Зима";
//     break;
//   case 2:
//     result = "Весна";
//     break;
//   case 3:
//     result = "Літо";
//     break;
//   case 4:
//     result = "Осінь";
//     break;
//   default:
//     result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
// }
// console.log("🚀 ~ result:", result);

// ** Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true,
// * якщо параметр age більше чи дорівнює 18.
// * В іншому випадку вона запитує підтвердження через confirm
// * і повертає його результат (true/false).
// */

// function isAdult(age) {
//   if (age >= 18) {
//     return true;
//   }
//   return confirm("Чи є вам 18 років");
// }
// console.log(isAdult(17));

// ** Використовуя if...else,
// * напишіть код, який буде питати через prompt:
// * "Яка офіційна назва JavaScript?"
// * Якщо користувач вводить "ECMASCRIPT",
// * то показати через alert: "Вірно!"
// * в противному випадку відобразити:"Не знаєте? ECMAScript!"
// * регістр не повинен впливати на правильну відповідь

// * Напишіть код, який буде питати
// * логін за допомогою prompt и логіровати результат
// * в консоль браузера
// * Якщо користувач вводить "admin",
// * то prompt запрашує пароль.
// * Якщо нічого не ввели чи нажали Cancel
// * вивести в alert рядок "Cancel!"
// * В противному випадку вивести рядок "Who are you?!"
// * Пароль перевіряти так:
// * Якщо введен пароль "123456",
// * то вивести рядок "Welcome, boss!"
// * в іншому випадку виводити рядок "Wrong password!"

// * Напишіть функцію checkNumber(num), яка перевіряє число:
// * Якщо число ділитися на 3 повертати "fizz"
// * Якщо ділитися на 5 повертати "buzz"
// * Якщо ділитися на 3 і на 5 повернути "fizzbuzz"
// * Додайте перевірку, що параметр дійсно є числом (в іншому випадку
// * функція має повертати "Not a number")
// * В якості дефолтного випадку повернути "Error!"

// * Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// * Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// * повертати з функції рядок - 'Not a number!'.

// * Створіть об'єкт calculator з наступними методами:
// * read(a, b) - приймає два аргумента і зберігає їх
// * як властивості об'єкта sum() повертає сумму збереженних значень
// * (з перевіркою на наявність властивостей в об'єкті)
// * mult() перемножає збереженні значення і повертає результат
// * (з перевіркою на наявність властивостей в об'єкті)
// * raise() возводить першу властивсть в ступінь другої і повертає результат
// * (з перевіркою на наявність властивостей в об'єкті)
// * винеси перевірку на наявність властивостей в об'єкті в окремий метод exist () */

// /**
//  * Типів транзакцій всього два.
//  * Можна покласти чи зняти гроші з рахунку.
//  */

const Transaction = {
  DEPOSIT: "deposit",
  WITHDRAW: "withdraw",
};
// /**
//  * Кожна транзакція це об'єкт із властивостями: id, type та amount
//  */
const account = {
  //Поточний баланс рахунку
  balance: 0,

  //Історія транзакцій
  transactions: [],

  // /**
  //  * Метод створює та повертає ою'єкт транзакції.
  //  * Приймає суму та тип транзакції.
  //  */
  createTransaction(amount, type) {},

  // /**
  //  * Метод, що відповідає за додавання суми до балансу.
  //  * Приймає суму транзакції. Викликає createTransaction для створення
  //  * об'єкта транзакції після чого додає його до історії транзакцій.
  //  */

  deposit(amount) {},

  // /**
  //  * Метод що відповідає за зняття суми з балансу. Приймає суму транзакції.
  //  * Викликає createTransactionдля створення об'єкта транзакції після чого
  //  * додає його до історії транзакцій.
  //  *
  //  * Якщо amount більше ніж поточний баланс, виводить повідомлення про те,
  //  * що зняття такої суми неможливе, недостатньо коштів.
  //  */

  withdraw(amount) {},

  // /**
  //  * Метод повертає поточний баланс
  //  */

  getBalance() {},

  // /**
  //  * Метод шукає та повертає об'єкт транзакції по id
  //  */

  getTransactionDetails(id) {},

  // /**
  //  * Метод повертає кількість коштів певного типу транзакції
  //  * з усієї історії тоанзакцій
  //  */

  getTransactionTotal(type) {},
};
