// **Наптши скрипт для відображення годин та хвилин у консоль браузера у вигляді
// *рядка формату "14 г. 26 хв.".Якщо значення змінної minuts дорівнює 0,
// *то виводь рядок "14 г.", без хвилин.
// *

// const hours = 14;
// const minuts = 0;
// let timestring;
// // if (minuts > 0) {
// //   timestring = `${hours}г. ${minuts}хв.`;
// // } else {
// //   timestring = `${hours}г.`;
// //   console.log("🚀 ~ timestring:", timestring);
// // }
// timestring = minuts > 0 ? `${hours}г. ${minuts}хв.` : `${hours}г.`;
// console.log("🚀 ~ timestring:", timestring);

// **Напиши скрипт для відображення часу дедлайну злачі проєкту.Вмкористовуй if...else.
// *Якщо до дедлайну залишилось 0 днів - виведи "Today".
// *Якщо до дедлайну залишився 1 день - виведи "Tomorrow".
// *Якщо до дедлайну залишилось 2 дні - виведи "Owermorrow".
// *Якщо до дедлайну залишилось 3+ і більше днів - виведи "Date in the future".
// *

// const daysUntilDeadline = 2;
// // if (daysUntilDeadline === 0) {
// //   console.log("Today");
// // } else if (daysUntilDeadline === 1) {
// //   console.log("Tomorrow");
// // } else if (daysUntilDeadline === 2) {
// //   console.log("Owermorrow");
// // } else {
// //   console.log("Date in the future");
// // }
// switch (daysUntilDeadline) {
//   case 0:
//     console.log("Today");
//     break;
//   case 1:
//     console.log("Tomorrow");
//     break;
//   case 2:
//     console.log("Owermorrow");
//     break;

//   default:
//     console.log("Date in the future");
// }

// let username;

// userName.addEventListener("change", function (event) {
//   const input = event.target;
//   const username = input.value;
//   switch (username) {
//     case "Poly":
//     case "Mango":
//       result.textContent = "ADMIN";
//       break;

//     default:
//       result.textContent = "Unregister user";
//   }
// });

//** Напиши скрипт вибору опції доставки товару.
// * Опція зберігається в змінній: 1 - самовмвіз, 2 - Кур'єр, 3 - пошта.
// * В зтінну message записати повідомлення в залежності від опції.
// * "Ви зможете забрати товар завтра з 12:00 в нашому офісі"
// * "Куд'єр доставить доставить замовлення завтра з 9:00 до 18:00"
// * "Посилку буде відправлено сьогодні"
// * "Вам зателефонує менеджер"
// *

// const option = 1;
// let message = "";
// switch (option) {
//   case 1:
//     message = `Ви зможете забрати товар завтра з 12:00 в нашому офісі`;
//     break;
//   case 2:
//     message = `Куд'єр доставить доставить замовлення завтра з 9:00 до 18:00`;
//     break;
//   case 3:
//     message = `Посилку буде відправлено сьогодні`;
//     break;

//   default:
//     message = `Вам зателефонує менеджер`;
// }
// console.log("🚀 ~ message:", message);

// **  Напиши скрипт перевірки підписки користувача при доступі до контента
//  * - Є три типа підписки: free, pro і vip.
//  * - Отримати доступ можуть тільки користувачі, pro і vip.
// *

// const sub = "free";
// const hasAccess = sub === "pro" || sub === "vip";
// console.log("🚀 ~ hasAccess:", hasAccess);

// **
//  * Напиши скрипт, який перевіряє моєливість відкрити чат з користувачем
//  * Для цього користувач має бути:
//  * - другом
//  * - онлайн
//  * - без режима не турбевати
//  *

// const isOnline = true;
// const isFriend = true;
// const isDnd = true;

// const canOpenChat = isOnline && isFriend && !isDnd;
// console.log("Можна відкрити чат?", canOpenChat);
